---
kind: type
id: T:Autodesk.Revit.DB.Electrical.InsulationTypeSet
source: html/7062c831-5c2f-4058-788b-5394c066fd16.htm
---
# Autodesk.Revit.DB.Electrical.InsulationTypeSet

A set that contains insulation types.

## Syntax (C#)
```csharp
public class InsulationTypeSet : APIObject,
	IEnumerable
```